Revit 2024 API
AnalysisDisplayVectorSettings.ArrowheadScale Property
 Type of arrow head scaling.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2012
Syntax
C#
public AnalysisDisplayStyleVectorArrowheadScale ArrowheadScale { get; set; }
Visual Basic
Public Property ArrowheadScale As AnalysisDisplayStyleVectorArrowheadScale
	Get
	Set
Visual C++
public:
property AnalysisDisplayStyleVectorArrowheadScale ArrowheadScale {
	AnalysisDisplayStyleVectorArrowheadScale get ();
	void set (AnalysisDisplayStyleVectorArrowheadScale value);
}
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
See Also
AnalysisDisplayVectorSettings Class
Autodesk.Revit.DB.Analysis Namespace